INSERT INTO genres(name)
VALUES('Rock'),
	    ('Deep-house'),
	    ('Hip-Hop'),
	    ('Pop'),
	    ('Techno');
	  
	  
INSERT INTO authors(name)
VALUES('Король и шут'),
      ('Morgenstern'),
      ('Кукрыниксы'),
      ('Шатунов'),
      ('Каста'),
      ('Blue Six'),
      ('Kaskade'),
      ('Scooter'),
      ('Ария');


INSERT INTO genresauthors 
VALUES (1,1),
	   (1,2),
	   (1,3),
	   (1,9),
	   (2,2),
	   (2,6),
	   (2,7),
	   (3,2),
	   (3,5),
	   (4,2),
	   (4,4),
	   (5,2),
	   (5,8);

INSERT INTO albums (name, year)
VALUES ('Жаль, нет ружья', 2002),
       ('Камнем по голове', 1996),
       ('До того как стал известен', 2018),
       ('Last One', 2022),
       ('Смерть поэта',2013),
       ('Не молчи...', 2018),
       ('Альбомба', 2021),
       ('My LIFE', 2018),
       ('God Save the Rave', 2021);

INSERT INTO authorsalbums
VALUES (1,1),
	   (1,2),
	   (2,3),
	   (2,4),
	   (3,5),
	   (4,6),
	   (5,7),
	   (7,8),
	   (8,9);

INSERT INTO songs (name, duration, albums_id)
VALUES ('Мой характер', 351, 1),
       ('Смешной совет',405, 1),
       ('Дурак и молния', 154, 2),
       ('Внезапная голова', 224, 2),
       ('Танцуй', 345, 3),
       ('Я хороший', 301, 3),
       ('Герой', 245, 4),
       ('Вернуть прошлое', 302, 4),
       ('Костёр', 418, 5),
       ('Капли', 501, 5),
       ('Не бойся', 334,6),
       ('Звезда', 455,6),
       ('Дома никого', 251,7),
       ('Муха', 137,8),
       ('On Your Mind', 520,8),
       ('This these Days',403, 9),
       ('Анастасия', 657, 9);

INSERT INTO collection (name, year)
VALUES ('сборник 1', 2001),
	   ('сборник 2', 2006),
	   ('сборник 3', 2008),
	   ('сборник 4', 2008),
	   ('сборник 5', 2013),
	   ('сборник 6', 2014),
	   ('сборник 7', 2019),
	   ('сборник 8', 2020),
	   ('сборник 9', 2021),
	   ('сборник 10', 2022);
	   
INSERT INTO songcollection 
VALUES(1,1),
      (11,1),
      (9,1),
      (15,1),
      (2,2),
      (10,2),
      (7,2),
      (11,2),
      (3,2),
      (17,3),
      (5,3),
      (8,3),
      (4,3),
      (13,3),
      (1,3),
      (14,4),
      (12,4),
      (16,4),
      (5,5),
      (7,5),
      (11,5),
      (17,5),
      (2,5),
      (9,5),
      (7,6),
      (14,6),
      (4,7),
      (7,7),
      (10,7),
      (16,8),
      (1,8),
      (4,9),
      (12,9),
      (8,9),
      (2,9),
      (5,10),
      (7,10),
      (13,10),
      (9,10),
      (14,10),
      (17,10),
      (2,10),
      (6,10);
      
	   

